upgrate_data_wage/low_dim/vel3.202020202020202/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       130;
    }
    outlet
    {
        type            patch;
        nFaces          5;
        startFace       135;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          5;
        startFace       140;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          15;
        startFace       145;
    }
    obstacle
    {
        type            patch;
        nFaces          10;
        startFace       160;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          150;
        startFace       170;
    }
)

// ************************************************************************* //
